Revit 2015 API
FabricSheet Class
 An object that represents an Fabric Sheet Element within the Autodesk Revit project.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
Since: 2013
Syntax
C#
public class FabricSheet : Element
Visual Basic
Public Class FabricSheet _
	Inherits Element
Visual C++
public ref class FabricSheet : public Element
Remarks
 This object derived from the Element base object and such supports all the methods of that object such as the ability to retrieve the parameters of that object. The Fabric Sheet element is available only in the Autodesk Revit Structure product.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.Element
 Autodesk.Revit.DB.Structure.FabricSheet
See Also
FabricSheet Members
Autodesk.Revit.DB.Structure Namespace